namespace Game.Editor
{
    public enum CommanderChinese
    {                //            0   没做完，肯定影响使用
        未指定,      //            0.5 部分单位、科技没录入显示，可能影响使用，也可能不影响使用
        埃蒙,        //            1   单位、科技、面板 已经录入，如果有缺失请提交bug反馈
        阿巴瑟,      // 0
        阿拉那克,    // 0.5        GitCode 搜索 SC2CoopPlugin 下载软件
        大主教,      // 1          Github 搜索 SC2CoopPlugin 能找到完整的源码
        德哈卡,      // 1          MIT协议
        菲尼克斯,    // 1
        霍纳与汉,    // 0.5
        凯拉克斯,    // 0.5
        烤乳鸽,      // 1
        蒙斯克,      // 时间识别错误
        诺娃,        // 0.5
        雷诺,        // 0.5
        斯台特曼,    // 1
        斯图科夫,    // 0
        思旺,        // 0.5
        泰凯斯,      // 1
        沃拉尊,      // 1
        扎加拉,      // 0.5
        泽拉图,      // 0.5
    }
}