using System;
using Table;

namespace Game.Editor
{
    [Flags]
    [Serializable]
    public enum UnitLabelChinese
    {
        无 = 0,
        轻甲 = 0x0000_0001,
        重甲 = 0x0000_0002,
        重型 = 0x0000_0004,
        生物 = 0x0000_0010,
        机械 = 0x0000_0020,
        建筑 = 0x0000_0040,
        英雄 = 0x0000_0080,
        灵能 = 0x0000_0100,
        侦查单位 = 0x0000_0200,
        不可运输 = 0x0000_0400,
        限时单位 = 0x0000_0800,
        地图Boss = 0x0000_1000,
        独狼检查 = 0x0000_2000,
        不可操作 = 0x0000_4000,
        飞行目标 = 0x0001_0000,
        地面目标 = 0x0002_0000,
    }
}